#+title: Elden Ring Walkthrough
#+author: KRV Perera
#+email: rukshan.viduranga@gmail.com

* Navigation
:PROPERTIES:
:CUSTOM_ID: TOP
:END:

[[file:krvperera.org][Home]] [[file:office.org][OFFICE]] [[file:linux.org][LINUX]] [[file:country.org][Country]] [[file:org-mode-reference-in.org][HotKeys]] [[file:Professional.org][Professional]] [[#BOTTOM][BOTTOM]]

* Items I need to farming

** Exalted Flesh

| Item            | place                                                  | count |
|-----------------+--------------------------------------------------------+-------|
| Rowa fruit      |                                                        |     5 |
| Lump of flesh   | Animals kills, Bell bearing at night in Church of vows |     1 |
| Hefty Best bone |                                                        |     1 |
| Arteria leaf    |                                                        |     1 |


* My Current Build

| Stat         | Base Value | Radagons Soreseal | With Great Rune |
|--------------+------------+-------------------+-----------------|
| Vigor        |         35 |                40 |              45 | 
| Mind         |         19 |                19 |              24 |
| Endurance    |         17 |                22 |              27 |
| Strength     |         19 |                24 |              29 |
| Dexterity    |         17 |                22 |              27 |
| Intelligence |         24 |                24 |              29 |
| Faith        |         19 |                19 |              24 |
| Arcane       |          9 |                 9 |              14 |
|--------------+------------+-------------------+-----------------+
| Total        |   178      |               218 |             127 |
#+TBLFM: @>$2=vsum(@I..@II)
#+TBLFM: @>$3=vsum(@I..@II)
#+TBLFM: @>$4=vsum(@I..@II)

** FightinCowboy Weapons
- Bloodhound's Fang +5
- uality Morning Star +6

* Builds

** Stats caps

| Stat         | cap1 |   cap2 | cap3 |
|--------------+------+--------+------|
| Vigor        |   40 |        |   60 |
| Mind         |      |     55 |   60 |
| Endurance    |      |     50 |      |
| Strength     |   20 |     55 |   80 |
| Dexterity    |   20 |     55 |   80 |
| Intelligence |   20 | 50, 60 |   80 |
| Faith        |   20 | 50, 60 |   80 |
| Arcane       |   20 | 50, 60 |   80 |
|--------------+------+--------+------|
| Total        |  140 |        |  520 |
#+TBLFM: @>$2=vsum(@I..@II)
#+TBLFM: @>$4=vsum(@I..@II)

** Immortal Paladin [[https://www.youtube.com/watch?v=Z9BDkcTpHNE&t=123s][Link]]


| Stat         | value |
|--------------+-------|
| Vigor        |    40 |
| Mind         |    20 |
| Endurance    |    30 |
| Strength     |    65 |
| Dexterity    |    17 |
| Intelligence |    13 |
| Faith        |    31 |
| Arcane       |     9 |
|--------------+-------|
| Total        |   229 |
#+TBLFM: @>$2=vsum(@I..@II)

Clawmark seal
Shard of Alexander
Sacred Scoprion Charm
Erdtree's Flavour +2
Radagon source seal

Dragoncrest GreatShield Talisman - Enormously Boosts physical damage

| Item                                | Effect           | Value | Level |   |
|-------------------------------------+------------------+-------+-------+---|
| Iron Great, Inseparable great sword | Blade Dance      |       |    25 |   |
| Banished Knight Great Sword         | Blade Dance      |       |    25 |   |
| Heavy Greate Stars                  | Prayerful Strike |       |    25 |   |
|-------------------------------------+------------------+-------+-------+---|

Shard of Alexander - Greatly boosts the attack power of skills


** Spellsword Build - The Exiled Mage [[https://www.youtube.com/watch?v=BLTmyVRAMrw&list=PL7RtZMiaOk8gF9ezBWxRgN6awSM91rAeT&index=13][Link]]

| Stat         | value |
|--------------+-------|
| Vigor        |    60 |
| Mind         |    22 |
| Endurance    |    30 |
| Strength     |    30 |
| Dexterity    |    18 |
| Intelligence |    50 |
| Faith        |    14 |
| Arcane       |     9 |
|--------------+-------|
| Total        |   233 |
#+TBLFM: @>$2=vsum(@I..@II)

| Item                      | Effect             | Value | Level |                 |
|---------------------------+--------------------+-------+-------+-----------------|
| Magic Nightrider Glaive   | Attack Power       |   727 |    25 | Sword Dance     |
| Lordsworns Straight Sword | Attack Power       |   517 |    25 | Hearfrost Stomp |
| Erdtree Great Shield      | Golden Retaliation |   517 |    10 |                 |
| Academy Glintstone Staff  | Sorcery Scaling    |   269 |    25 |                 |
| Loretta's War Sickle      |                    |       |    10 |                 |
|---------------------------+--------------------+-------+-------+-----------------|

Erdtree Favour, Marika's Soreseal, Radagon Icon, Graven-Mass Talisman

** Quality

| Stat         | value |
|--------------+-------|
| Vigor        |    60 |
| Mind         |    13 |
| Endurance    |    34 |
| Strength     |    55 |
| Dexterity    |    55 |
| Intelligence |     9 |
| Faith        |    14 |
| Arcane       |     9 |
|--------------+-------|
| Total        |   249 |
#+TBLFM: @>$2=vsum(@I..@II)

** Hybrid Caster Build - The Pursuer

| Stat         | value |
|--------------+-------|
| Vigor        |    60 |
| Mind         |    41 |
| Endurance    |    10 |
| Strength     |    12 |
| Dexterity    |    12 |
| Intelligence |    50 |
| Faith        |    50 |
| Arcane       |    14 |
|--------------+-------|
| Total        |   249 |
#+TBLFM: @>$2=vsum(@I..@II)

| Item                     | Effect              | Value | Level |
|--------------------------+---------------------+-------+-------|
| Sword of Night and Flame | Attack Power        |   701 |    10 |
| Golden Order seal        | Incantation Scaling |   345 |    10 |
| Prince of Deaths Staff   | Sorcery Scaling     |   286 |    25 |
|--------------------------+---------------------+-------+-------|

Erdtree Favour, Marika's Soreseal, Radagon Icon, Graven-Mass Talisman

* Main ideas

** Assasin
*** Golden parry
This is royal capital need to wait some time
**** Buckler parry
**** Best small shield
Iron Roundshield

*** Good bow
**** Arrows

***** [[https://eldenring.wiki.fextralife.com/Interactive+map?id=2353&lat=-164.63125&lng=136.080779&zoom=8][Merchant]]
Isolated Merchant Dragonbarrow shop
    Beast Repellent torch
    Serpent Arrow

***** [[https://eldenring.wiki.fextralife.com/interactive+map?id=1158&lat=-187.975001&lng=143.226132&zoom=8][Merchant]] Normadic merchant Caleid South
Normadic Warrior Cookbook [15]
    Rotbone arrows/bolt

*** Good Crit Damage
*** Stance break
*** Poise Armor
*** Assassin's Cerulean Dagger - Black Knife Catacombs - NE Liurnia Of the Lakes
** Cinueda + Dragon Crest Shield [[https://www.youtube.com/watch?v=SbK4jVYPP8g][YouTue]]

** Carian Knight Armor [[https://www.youtube.com/watch?v=LPa_TMTyoac][Link]]

** The 5 Most Secretlt powerful werapons [[https://www.youtube.com/watch?v=A4G5y6g-slQ][Link]]

** Vampire Build [[https://www.youtube.com/watch?v=xwbx_djjrWA][Link]]
Need to wait for volcano manner

** Use Grand Lift

** Spellsword
*** Sword of astel

*** Terra Magica

*** Sword of night and flame ??

* Walk Through
** FightinCowboy
:PROPERTIES:
:CUSTOM_ID: FIGHTINCOWBOY
:END:
*** TODO [[https://www.youtube.com/watch?v=p4uxeniQsg4&list=PL7RtZMiaOk8gdRf130w4gFYyhstL-5VRh&index=11][Stormveil Castle]]
**** TODO Defeat the Crucible Knight

*** DONE PART 12 - [[https://www.youtube.com/watch?v=EQzBxb_ZQWQ&list=PL7RtZMiaOk8gdRf130w4gFYyhstL-5VRh&index=12][Godrick the Grafted]]
CLOSED: [2022-05-19 බ්‍ර 15:15]
**** DONE Seed beast - door is open from Rampart tower
CLOSED: [2022-05-19 බ්‍ර 15:15]

*** DONE Abandoned Cave [[https://www.youtube.com/watch?v=orecZ59sHj8&list=PL7RtZMiaOk8gdRf130w4gFYyhstL-5VRh&index=30][Link]]
CLOSED: [2022-06-11 Sat 17:50]
    45, 15, 32, 35, 26, 14, 14, 12
*** TODO 15 - South Liurnia and the Rose Church - [[https://www.youtube.com/watch?v=epYkRmcA2nU&list=PL7RtZMiaOk8gdRf130w4gFYyhstL-5VRh&index=15][Link]]
**** TODO Stillwater cave
*** TODO 18 - Glntstone Dragon  Crystal Tunnels - [[https://www.youtube.com/watch?v=S0-bnk3XZU8&list=PL7RtZMiaOk8gdRf130w4gFYyhstL-5VRh&index=18][Link]]
**** Terra Magica
**** Two Crystalian - need a blunt weapon

* Assasin Stealth
[[https://www.youtube.com/watch?v=xCKi6g-Fm_E][Assasing Stealth]]
[[https://www.youtube.com/watch?v=DxCpnGtO1ns][ELDEN RING - The Best CRITICAL HIT VAMPIRIC BUILD for EVERYTHING: PARRY, STANCE BREAK & BACKSTABS]]


* Weapons

Item Discovery - Smoldering Church west of starting og Caleid


* Crafting Items
[[https://www.youtube.com/watch?v=QjxsxIefaAI][5 secret items]]
    Gravity stone chunks
    Exalted Flesh - increase damage


* Channels
:PROPERTIES:
:CUSTOM_ID: CHANNELS
:END:
** [[https://www.youtube.com/watch?v=iSjviLX1x1g][KhrazeGaming]]




[[#TOP][TOP]]

* Bottom Navigation
:PROPERTIES:
:CUSTOM_ID: BOTTOM
:END:
